<?php

return [
	'select' => [
		'country' => '国/エリア',
		'player1' => '選手1',
		'player2' => '選手2',
		'query' => '検索',
		'topN' => 'トップナンバー',
	],
	'selectBar' => [
		'filter' => [
			'comma' => '、',
			'desc' => 'スクリーニング: ',
		],
		'final' => [
			'y' => '決勝のみ',
		],
		'level' => [
			'a' => '全部',
			'g' => 'グランドスラムのみ',
			'm' => 'マスターズ1000のみ',
			't' => 'ツアーのみ',
		],
		'round' => [
			'w' => 'チャンピオン',
			'f' => '決勝',
			's' => '準決勝',
			'q' => '準々決勝',
			'final' => '決勝',
			'md' => '本戦',
			'sf' => '準決勝',
			'qf' => '準々決勝',
		],

		'md' => [
			'y' => '本戦のみ',
		],
		'sd' => [
			's' => 'シングルス',
			'd' => 'ダブルス',
		],
		'method' => [
			'c' => 'VS 国',
			'p' => 'VS 選手',
			't' => 'VS トップ選手',
		],
		'sfc' => [
			'a' => '全部',
			'c' => 'クレー',
			'g' => 'グラス',
			'h' => 'ハード',
			'p' => 'カーペット',
		],
		'type' => [
			'atp' => 'ATP',
			'wta' => 'WTA',
		],
	],
	'warning' => [
		'equalP1P2' => '選手は同名ではいけない',
		'wrongN' => '正しい数字を記入してください',
		'wrongNation' => '正しい国名を記入してください',
		'wrongP1' => '選手1の名前を記入してください',
		'wrongP2' => '選手2の名前を記入してください',
	],
	'thead' => [
		'year' => '年',
		'level' => 'レベル',
		'surface' => '表面',
		'event' => '大会',
		'round' => 'ラウンド',
		'result' => '結果',
		'games' => '得点',
	],
];
