<?php

return [
	'select' => [
		'country' => '國家/地區',
		'player1' => '選手1',
		'player2' => '選手2',
		'query' => '查詢',
		'topN' => 'Top N',
	],
	'selectBar' => [
		'filter' => [
			'comma' => '，',
			'desc' => '篩選條件：',
		],
		'final' => [
			'y' => '只看決賽',
		],
		'level' => [
			'a' => '全部',
			'g' => '只看大滿貫',
			'm' => '只看大師/一級賽',
			't' => '只看巡迴賽',
		],
		'md' => [
			'y' => '只看正賽',
		],
		'method' => [
			'c' => '選手與國家間',
			'p' => '選手間',
			't' => '選手與TOP選手間',
		],
		'sfc' => [
			'a' => '全部',
			'c' => '土場',
			'g' => '草地',
			'h' => '硬地',
			'p' => '地毯',
		],
		'type' => [
			'atp' => 'ATP',
			'wta' => 'WTA',
		],
	],
	'warning' => [
		'equalP1P2' => '選手1與選手2不可以相同',
		'wrongN' => '請正確填寫數字',
		'wrongNation' => '請正確填寫國家',
		'wrongP1' => '請正確填寫選手1',
		'wrongP2' => '請正確填寫選手2',
	],
];
