<?php

return [

	'tip' => '',

	'title' => [
		'schedule' => '竞猜赛程',
		'rule' => '竞猜规则',
		'rank' => '竞猜排名',
		'sign' => '竞猜报名',
	],

	'guess' => [
		'sets' => '盘数',
		'aces' => 'Aces',
		'time' => '时间',
		'hour' => '时',
		'minute' => '分',

		'deadline' => '截止于',
		'submit' => '提交',
		'total' => '单日得分',
		'rank' => '单日名次',
		'weekRank' => '当周名次',
		'absent' => '本日未参加',
	],

	'dcpk' => [
		'sign' => 'PK赛报名',
		'week' => '第:p1周',
		'signup' => '我要报名',
	],

	'errcode' => [
		'notLogin' => '登入后才能参加游戏',
		'noMatch' => '当前暂无比赛',
		'notClosed' => '不能在截止前查看别人的结果',
		'success' => '成功提交！请刷新后确认',
		'timeout' => '对不起，已经截止提交',
		'failed' => '提交失败，请重试',
		'wrongInfo' => '信息有误',
		'signed' => '已经报过名了',
		'ipBlocked' => '你所在的IP报名人数超限，报名失败',
		'deviceBlocked' => '你的设备报名人数超限，报名失败',
		'wrongBrowser' => '您的浏览器不支持，请更换浏览器',
		'wrongDevice' => '您的设备首次浏览本站不足5天，暂时不能报名',
		'notPermitted' => '你的账号不符合参赛要求',
	],

	'rule' => [

		'signDdl' => '必须填写首日(:p1)才能排入签表。报名截止时间是:p2',
		'3hour' => '截止前3小时',
		'ipRestrict' => '同一个IP最多只允许报名3个账号并且同一台设备最多只允许报名3个账号<br>一台设备首次浏览本站5天后才允许报名',

		'pick' => '每天<a href="' . url(App::getLocale() . '/guess') . '">点击这里</a>进行比分竞猜（注意每天的截止时间）<br>',

		'pickRule' => '
每天选出不超过6场比赛，在截止时间前提交胜者、总盘数、总ACE数、总用时。每日会计算一个总得分<br/>
    <br/>
    计算得分的规则：</br>
    　① 猜对胜者 +1 分，猜错 +0 分</br>
    　② 猜对盘数 +0.5 分，猜错 +0 分</br>
    　③ 猜对Ace数 +0.25 分，与真实值每相差 4% 少得 0.01 分，最少 +0 分</br>
    　④ 猜对用时(分钟) +0.25 分，与真实值每相差 3% 少得 0.01 分，最少 +0 分</br>
    额外说明：<br/>
　①如遇一方赛前退赛或对手临时变更，则该场比赛作废<br/>
　②若系统截止时间过迟，影响了某场比赛的竞猜，则该场比赛作废<br>
　③被延迟至次日的比赛仍算在竞猜当日的比分中。若次日仍未打完，则该场比赛作废<br>
　④如果一方赛中退赛，胜者为对手；盘数进行补齐(从退赛时起每分都算对手得，直到达到正常完赛标准)；ACE数与比赛用时不计分<br>',

		'roundPoint' => '
每周为一站比赛。赛程戳<a href="' . url(App::getLocale() . '/guess/calendar') . '">这里</a><br>
每周赛事依级别不同分为4档：GS、1000、500、250<br>
各轮次或名次对应积分:
<table>
	<tr><td></td><td>GS</td><td>1000</td><td>500</td><td>250</td></tr>
	<tr><td>冠军</td><td>2000</td><td>1000</td><td>500</td><td>250</td></tr>
	<tr><td>亚军</td><td>1300</td><td>650</td><td>325</td><td>163</td></tr>
	<tr><td>四强(3-4名)</td><td>780</td><td>390</td><td>195</td><td>98</td></tr>
	<tr><td>八强(5-8名)</td><td>430</td><td>215</td><td>108</td><td>54</td></tr>
	<tr><td>16强(9-16名)</td><td>240</td><td>120</td><td>60</td><td>30</td></tr>
	<tr><td>32强(17-32名)</td><td>120</td><td>60</td><td>30</td><td>15</td></tr>
	<tr><td>64强(33-64名)</td><td>70</td><td>35</td><td>18</td><td>9</td></tr>
	<tr><td>128强(64名以后)</td><td>10</td><td>10</td><td>5</td><td>5</td></tr>
	<tr><td>资格赛出线</td><td>30</td><td>25</td><td>-</td><td>-</td></tr>
	<tr><td>资格赛出局</td><td>10</td><td>8</td><td>-</td><td>-</td></tr>
</table>',

		'ko_itgl' => '
有如下两种排名方式：积分赛 与 PK赛<br>
积分赛通过每日得分相加进行排名，对应的积分即为本周赛事的积分<br>
PK赛通过将参赛者编入签表，进行两两PK，胜者晋级。按最终轮次对应的积分为本周赛事的积分<br>
与ATP/WTA相同，积分赛和PK赛均有52周排名<br>
<table>
	<tr><td></td><td>积分赛</td><td>PK赛</td></tr>
	<tr><td>报名</td><td>无需报名</td><td>提前在<a href="' . url(App::getLocale() . '/guess/sign') . '">这里</a>报名</td></tr>
	<tr><td>计分时段</td><td>每周</td><td>逢GS、1000赛所在周</td></tr>
	<tr><td>排位</td><td>按当周总积分的位次决定</td><td>按签表最终轮次决定</td></tr>
	<tr><td>52周排名计项</td><td>最好20项</td><td>最好15项</td></tr>
</table>',

		'itglNotice' => '
                积分赛注意事项：<br>
                1、只需提交竞猜结果即可参与积分。每周积一次分<br>
                2、上表为各轮次基准分。实际积分为：你的得分/最高得分*基准分。最高得分为当周冠军的得分<br>
                3、GS、1000赛至少积10分，500、250赛至少积5分<br>',

		'dcpkNotice' => '
                PK赛注意事项：<br>
                1、只在GS、1000赛进行<br>
                2、需在比赛首日的前一周内报名，必须竞猜首日并在签表抽出之前提交才会被排进签表，签表一般在首日截止前1小时抽出<br>
                3、若PK的两人得分相同，按以下优先级决定胜负：单场最高分，单场次高分，单场第三高分,...，本周积分赛的总得分；PK赛52周积分；积分赛52周积分；报名先后<br>
                4、若参与人数在64-96(不含)之间，正赛设64签，16种子，并设一轮资格赛，资格赛人数不超过32人<br>
                5、若参与人数在96-128(不含)之间，正赛设128签，32种子，靠前的种子首轮轮空，不设资格赛<br>
                6、若参与人数大于128，正赛设128签，32种子，并设一轮资格赛，资格赛人数不超过64人<br>
                7、入围资格与种子界定：<br>
                &nbsp;&nbsp;&nbsp;参与人数 = 报名且填写首日的人<br>
                &nbsp;&nbsp;&nbsp;所有参与的人按比赛前一周的积分赛52周排名倒序排列(相同则按报名时间先后)，按上述4-6规则决定正赛与资格赛席位<br>
                &nbsp;&nbsp;&nbsp;在入围正赛的人里，按PK赛52周排名高低(相同则按报名时间先后)决定种子排位<br>
                8、LL的判定：如果正赛首轮的首日，有选手未填写，则判定其退赛，由资格赛落败者或者未能排入资格赛签表的选手(也必须填写首轮首日)顶替<br>
                &nbsp;&nbsp;&nbsp;顶替顺序：资格赛落败者(按资格赛得分)，未排入资格赛的选手(按积分赛52周排名，相同则按报名先后)<br>
                9、每轮比赛的天数根据实际比赛进程决定<br>
                10、在任何一轮，只要选手还在签表中，却没有完整填写该轮的所有比赛，则取消其下次PK赛的参赛资格(不影响本次PK赛的继续。但如果对阵双方均一场未填，则他们都不能晋级，他们下轮对手将直接晋级)<br>',
	],
];
