<?php

return [

	'notice' => [

		'error' => '暂时不能查询到本场比赛',

	],

	'selector' => [
		'0' => '全场',
		'1' => '第一盘',
		'2' => '第二盘',
		'3' => '第三盘',
		'4' => '第四盘',
		'5' => '第五盘',

		'kph' => '公制:千米/时,米',
		'mph' => '英制:英里/时,英尺',
	],

	'statTitle' => [
		'dura' => '用时',
		'ace' => 'ACE',
		'df' => '双误',
		's1%' => '一发成功率',
		's1' => '一发得分率',
		's2' => '二发得分率',
		's' => '发球得分率',
		'rp%' => '接发球得分率',
		'r1%' => '接一发得分率',
		'r2%' => '接二发得分率',
		'sg%' => '保发率',
		'rg%' => '破发率',
		'wi' => '制胜分',
		'ue' => '非受迫性失误',
		'np%' => '网前得分率',
		'bp%' => '破发点转化率',
		'bs%' => '破发点挽救率',
		'tp' => '总得分',
		'f1f' => '最快一发速度',
		'f2f' => '最快二发速度',
		'f1a' => '平均一发速度',
		'f2a' => '平均二发速度',
		'fa' => '平均发球速度',
		'dis' => '跑动距离',
		'fe' => '受迫性失误',
		'as' => '制胜分(上网)',
		'ds' => '制胜分(小球)',
		'gs' => '制胜分(底线)',
		'l' => '制胜分(挑高)',
		'os' => '制胜分(过顶)',
		'ps' => '制胜分(穿越)',
		'v' => '制胜分(截击)',
		'mpr' => '最长连续得分',
		'mgr' => '最长连续胜局',
	],

];
