<?php

return [

	'intro' => '请选择下面的语言，共同建设本站',
	'intro2' => '1. 请按第三列的英文的翻译，填入第四列。如果翻译结果与英文相同请直接留空。（如果第三列的信息足够，就不用管前两列了）
<br>2. 由于版面限制，绿色底的翻译最好不要超过英文的长度。如果翻译结果过长，且无法用缩写准确表示其含义，建议留空，默认按英文展示
<br>3. 如果英文中有 :p1 :p2 的字样，请在你的翻译中保留它
<br>4. 无论填多少行都可以随时提交。我整合之后统一更改
<br>5. 如果觉得一行行打字太累，可以复制到Excel编辑后发送给我
<br>谢谢你的帮助',

	'button' => [
		'submit' => '提交',
		'submitting' => '提交中...请稍候',
		'submitted' => '提交成功！',
		'unsupport' => '很抱歉系统当前不支持你所提交的语言。请与我联系后再添加',
	],

	'table' => [
		'category' => '种类',
		'path' => '路径',
		'englishWords' => '英语中写法',
		'yourFilling' => '你的语言 (:p1)',
	],

];
